In [190]:
import pandas as pd

In [191]:
# Index, Series, Dataframe 
# 1, 1, 2 dimensional data structure

In [192]:
# Index -- is used to index another data structure in pandas
# 'Index' is singular
# Index ka plural -- Indices and Indexes
# Elements of Index object are called Indices.
# Multiple index objects would be called Indexes

In [193]:
# Types of Index object
# float64, int64, RangeIndex, boolean Index

In [194]:
ind = pd.Index([1,2,3,4,5])

In [16]:
ind

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [17]:
# Since pandas is built on top of Numpy

In [18]:
ind.ndim

1

In [19]:
ind.shape# tuple return

(5,)

In [20]:
ind.size

5

In [22]:
type(ind)

pandas.core.indexes.numeric.Int64Index

In [23]:
# Float Index

In [24]:
float_index = pd.Index([1,2,3, 4.5])

In [25]:
float_index

Float64Index([1.0, 2.0, 3.0, 4.5], dtype='float64')

In [26]:
range_index = pd.Index(range(1,20,3))

In [27]:
range_index

RangeIndex(start=1, stop=20, step=3)

In [28]:
range_index = pd.RangeIndex(1,20,3)

In [29]:
range_index

RangeIndex(start=1, stop=20, step=3)

In [30]:
# Index objects are iterable

In [31]:
ind

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [32]:
for ele in ind:
    print(ele)

1
2
3
4
5

In [33]:
squared_ind = [ele ** 2 for ele in ind]

In [34]:
squared_ind

[1, 4, 9, 16, 25]

In [35]:
# membership testing

In [36]:
ind

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [37]:
69 in ind

False

In [38]:
69 not in ind

True

In [39]:
# Index object is like a set but isme duplicate values allowed hoti hain

In [40]:
new_index = pd.Index([1,2,3,5,4,4,4,4])

In [41]:
new_index

Int64Index([1, 2, 3, 5, 4, 4, 4, 4], dtype='int64')

In [47]:
ind1 = pd.Index([1,2,3,4])
ind2 = pd.Index([2.0,5,6])

In [43]:
ind1, ind2

(Int64Index([1, 2, 3, 4], dtype='int64'), Int64Index([2, 5, 6], dtype='int64'))

In [48]:
intersection = ind1.intersection(ind2)

In [49]:
intersection

Float64Index([2.0], dtype='float64')

In [50]:
union = ind1.union(ind2)

In [51]:
union

Float64Index([1.0, 2.0, 3.0, 4.0, 5.0, 6.0], dtype='float64')

# Series

In [53]:
# Series are 1 dimensional data structure
# Series and Index me utna hi difference he jitna list and dictionary me he
# Series is like an associative array 
# Index is also an associative container but we can have only implicit indexing in that

In [54]:
ser = pd.Series([1,2,3,45])

In [55]:
ser

0     1
1     2
2     3
3    45
dtype: int64

In [56]:
ser = pd.Series([1,2,3,45], index = ['Abhishek', 'Abhilash', 'Rohan', 'Sameer'])

In [57]:
ser

Abhishek     1
Abhilash     2
Rohan        3
Sameer      45
dtype: int64

In [58]:
ser['Abhishek']

1

In [59]:
ser[0]

1

In [60]:
# When we use the Index parameter then we have defined the index explicitly.
# unlearn -- bhool jaao -- indices, indexes, index
ser = pd.Series([1,2,3,4,5], index = ['a','b','c','a','b'])

In [61]:
ser

a    1
b    2
c    3
a    4
b    5
dtype: int64

In [62]:
ser['a'] # It is like dictionary but not dictionary

a    1
a    4
dtype: int64

In [63]:
ser[0]

1

In [64]:
# series pe hum built ins functions lga skte hain

In [65]:
ser

a    1
b    2
c    3
a    4
b    5
dtype: int64

In [72]:
len(ser)
max(ser)
min(ser)
list(ser)
sorted(ser)
sum(ser)
# Bhool jaao, yaad rkhne

15

In [73]:
# pandas series also has methods

In [74]:
ser

a    1
b    2
c    3
a    4
b    5
dtype: int64

In [83]:
ser.min()
ser.max()
ser.mean()
ser.mode()
ser.std()
ser.info()
ser.describe()

<class 'pandas.core.series.Series'>
Index: 5 entries, a to b
Series name: None
Non-Null Count  Dtype
--------------  -----
5 non-null      int64
dtypes: int64(1)
memory usage: 252.0+ bytes

count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

In [87]:
third_quartile = ser.describe()['75%']

In [88]:
third_quartile

4.0

In [89]:
# Implicit Indexing me numbers 0,1,2,3...., 
# Explicit Indexing me bhi numbers

In [90]:
ser = pd.Series([1,2,3,4,5],index = [1,2,3,4,5])

In [91]:
ser

1    1
2    2
3    3
4    4
5    5
dtype: int64

In [92]:
ser[1] # explicit waale ko use krta hain
# yaad mt rkhna

1

In [93]:
ser[1:4] # implicit index
# implicit me last vaala count nhi hota
# explicit me last waala count hota he

2    2
3    3
4    4
dtype: int64

In [94]:
ser = pd.Series([1,2,3,4,5], index = list('abcde'))

In [95]:
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [96]:
ser[0:4]

a    1
b    2
c    3
d    4
dtype: int64

In [97]:
ser['a':'c'] # explicit indexing me slicing -- last waala included

a    1
b    2
c    3
dtype: int64

In [98]:
# Series object can also have attributes

In [99]:
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [101]:
ser.dtype

dtype('int64')

In [102]:
ser.ndim

1

In [103]:
ser.shape

(5,)

In [104]:
ser.size

5

In [105]:
ser.hasnans # yaad rkhna

False

In [106]:
# Series ojects are mutable

In [107]:
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [108]:
ser['a'] = 20

In [109]:
ser

a    20
b     2
c     3
d     4
e     5
dtype: int64

In [110]:
# series objects are mutable associative iterable container

In [111]:
for ele in ser:
    print(ele)

20
2
3
4
5

In [112]:
# membership testing
25 in ser

False

In [113]:
25 not in ser

True

In [116]:
dict(ser)

{'a': 20, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

In [117]:
my_dict = {'a': 20, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

In [118]:
# We can convert a dictionary into a series

In [130]:
ser = pd.Series(my_dict)

In [131]:
ser

a    20
b     2
c     3
d     4
e     5
dtype: int64

In [135]:
ser[[0,4]]

a    20
e     5
dtype: int64

In [136]:
ser[['a','e','e']]

a    20
e     5
e     5
dtype: int64

In [137]:
# iloc and loc are not functions

In [138]:
ser = pd.Series([1,2,3,4,5], index = [1,2,3,4,5])

In [139]:
ser

1    1
2    2
3    3
4    4
5    5
dtype: int64

In [140]:
ser.iloc[1]
# ser.iloc(1) mt krna

2

In [141]:
ser.loc[1]

1

In [143]:
ser = pd.Series([1,2,3,4,5], index = list('abcde'))

In [144]:
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [145]:
# we can also do boolean masking inside a series object

In [146]:
ser == 1 # returns us a boolean series which is also called as mask

a     True
b    False
c    False
d    False
e    False
dtype: bool

In [147]:
ser[ser == 1]

a    1
dtype: int64

In [163]:
nba = pd.read_csv('data/nba.csv')

In [164]:
nba = nba['Name']

In [165]:
nba

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [166]:
nba.hasnans

True

In [167]:
nba.size

458

In [168]:
nba.shape

(458,)

In [169]:
nba.ndim

1

In [170]:
len(nba)

458

In [171]:
sorted(nba)

TypeError: '<' not supported between instances of 'float' and 'str'

In [172]:
# This method is used to fill Null values in a series with a specified value
nba.fillna('Unknown', inplace=True) # yaad rkhlo
# nba = nba.fillna('Unknown')

In [173]:
nba
# NaN ke saath 2 kaam -- ya toh drop krdo ya toh fill krdo

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457          Unknown
Name: Name, Length: 458, dtype: object

In [174]:
# apply , map

In [175]:
nba

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457          Unknown
Name: Name, Length: 458, dtype: object

In [177]:
pd.Series({key:len(nba[key]) for key in nba.index})

0      13
1      11
2      12
3      11
4      13
       ..
453    12
454     9
455    12
456    11
457     7
Length: 458, dtype: int64

In [178]:
nba

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457          Unknown
Name: Name, Length: 458, dtype: object

In [180]:
nba_lengths = nba.apply(len)

In [181]:
nba_lengths

0      13
1      11
2      12
3      11
4      13
       ..
453    12
454     9
455    12
456    11
457     7
Name: Name, Length: 458, dtype: int64

In [182]:
nba

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457          Unknown
Name: Name, Length: 458, dtype: object

In [184]:
def do_upper(name):
    return name.upper()

In [185]:
do_upper('Abhishek Jha')

'ABHISHEK JHA'

In [186]:
nba

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457          Unknown
Name: Name, Length: 458, dtype: object

In [187]:
nba.apply(do_upper)

0      AVERY BRADLEY
1        JAE CROWDER
2       JOHN HOLLAND
3        R.J. HUNTER
4      JONAS JEREBKO
           ...
453     SHELVIN MACK
454        RAUL NETO
455     TIBOR PLEISS
456      JEFF WITHEY
457          UNKNOWN
Name: Name, Length: 458, dtype: object

In [188]:
# itne pr khatam

# dropna(), fillna(), head(), tail(), map(), sort_values(), sort_index()
# value_counts(), copy()

# View and copy

In [195]:
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [196]:
ser.head()

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [197]:
nba = pd.read_csv('data/nba.csv')

In [198]:
nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [199]:
names = nba['Name']

In [200]:
names

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [201]:
names.head()

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [202]:
names.tail()

453    Shelvin Mack
454       Raul Neto
455    Tibor Pleiss
456     Jeff Withey
457             NaN
Name: Name, dtype: object

In [203]:
names.head(3)

0    Avery Bradley
1      Jae Crowder
2     John Holland
Name: Name, dtype: object

In [204]:
names.tail(3)

455    Tibor Pleiss
456     Jeff Withey
457             NaN
Name: Name, dtype: object

In [205]:
# head() and tail() return view

In [206]:
# view matlab same data

In [208]:
names.head(5)[0] = 'Whatever'

In [212]:
names.iloc[0] = 'Avery Bradley'

C:\Users\HU496FA\AppData\Local\Temp\ipykernel_33360\2825469303.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  names.iloc[0] = 'Avery Bradley'

In [213]:
names

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [214]:
first_five_names = names.head().copy()
#

In [215]:
first_five_names

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [216]:
first_five_names[0] = 'Whatever'

In [218]:
first_five_names

0         Whatever
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
Name: Name, dtype: object

In [219]:
names

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [220]:
names.hasnans

True

In [221]:
names.sort_values()

152      Aaron Brooks
356      Aaron Gordon
328    Aaron Harrison
404     Adreian Payne
312        Al Horford
            ...
270    Xavier Munford
402       Zach LaVine
271     Zach Randolph
237     Zaza Pachulia
457               NaN
Name: Name, Length: 458, dtype: object

In [222]:
names

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [224]:
names = names.copy()

In [225]:
names.sort_values(inplace=True)

In [226]:
names

152      Aaron Brooks
356      Aaron Gordon
328    Aaron Harrison
404     Adreian Payne
312        Al Horford
            ...
270    Xavier Munford
402       Zach LaVine
271     Zach Randolph
237     Zaza Pachulia
457               NaN
Name: Name, Length: 458, dtype: object

In [229]:
names.sort_values(ascending = False, inplace = True)

In [230]:
names

237      Zaza Pachulia
271      Zach Randolph
402        Zach LaVine
270     Xavier Munford
386    Wilson Chandler
            ...
404      Adreian Payne
328     Aaron Harrison
356       Aaron Gordon
152       Aaron Brooks
457                NaN
Name: Name, Length: 458, dtype: object

In [231]:
names.sort_index()

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [232]:
names

237      Zaza Pachulia
271      Zach Randolph
402        Zach LaVine
270     Xavier Munford
386    Wilson Chandler
            ...
404      Adreian Payne
328     Aaron Harrison
356       Aaron Gordon
152       Aaron Brooks
457                NaN
Name: Name, Length: 458, dtype: object

In [233]:
names.sort_index(inplace = True)

In [234]:
names

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

# dropna() and fillna()

In [236]:
college = pd.read_csv('data/nba.csv')['College'].copy()

In [237]:
college

0                  Texas
1              Marquette
2      Boston University
3          Georgia State
4                    NaN
             ...
453               Butler
454                  NaN
455                  NaN
456               Kansas
457                  NaN
Name: College, Length: 458, dtype: object

In [238]:
college.hasnans

True

In [240]:
college.unique() # vvimp
# by default nan include krta he

array(['Texas', 'Marquette', 'Boston University', 'Georgia State', nan,
       'LSU', 'Gonzaga', 'Louisville', 'Oklahoma State', 'Ohio State',
       'Washington', 'Kentucky', 'North Carolina', 'Arizona',
       'Georgia Tech', 'Cincinnati', 'Miami (FL)', 'Stanford', 'Syracuse',
       'Saint Louis', 'Kansas', 'Georgetown', 'Texas A&M', 'UCLA', 'UNLV',
       'Wichita State', "Saint Joseph's", 'Notre Dame', 'Norfolk State',
       'Duke', 'Murray State', 'Tennessee State', 'Bowling Green',
       'Purdue', 'Wake Forest', 'Michigan', 'Missouri', 'USC',
       'Villanova', 'Rider', 'Utah', 'Belmont', 'Davidson', 'Vanderbilt',
       'Michigan State', 'Florida', 'Washington State', 'Arizona State',
       'Oklahoma', 'Wyoming', "St. John's", 'Maryland', 'Wisconsin',
       'Utah Valley', 'North Carolina State', 'UC Santa Barbara',
       'Baylor', 'Connecticut', 'Oregon State', 'New Mexico', 'Oregon',
       'Creighton', 'Arkansas', 'Memphis', "Saint Mary's", 'Tennessee',
       'Alabama', 'Georgia', 'Colorado', 'Boston College', 'Temple',
       'Fresno State', 'IUPUI', 'Eastern Washington', 'Western Michigan',
       'Virginia', 'Northeastern', 'Western Kentucky', 'Nevada',
       'Illinois', 'Kansas State', 'Charleston', 'Clemson',
       'Blinn College', 'Providence', 'Detroit', 'Rhode Island',
       'California', 'Cleveland State', 'Iowa State', 'Florida State',
       'Long Beach State', 'Penn State', 'Indiana', 'San Diego State',
       'Western Carolina', 'Houston', 'Xavier', 'Old Dominion',
       'Minnesota', 'Louisiana Tech', 'Bucknell', 'Pittsburgh',
       'Virginia Commonwealth', 'Harvard', 'Marshall', 'Iowa',
       'St. Bonaventure', 'Louisiana-Lafayette', 'Colorado State',
       'Virginia Tech', 'DePaul', 'Morehead State', 'Central Michigan',
       'Weber State', 'Lehigh', 'Westchester CC', 'Dayton', 'Butler'],
      dtype=object)

In [241]:
len(college.unique()) # including null values

119

In [243]:
college.nunique() # tell the number of unique values excluding null values

118

In [246]:
college.value_counts(ascending=True)

Tennessee State     1
San Diego State     1
Penn State          1
Georgia             1
Bowling Green       1
                   ..
UCLA               15
North Carolina     16
Kansas             18
Duke               20
Kentucky           22
Name: College, Length: 118, dtype: int64

In [256]:
college.value_counts(ascending=True).sort_index(ascending = True) # method chaining

Alabama              3
Arizona             13
Arizona State        2
Arkansas             3
Baylor               1
                    ..
Western Michigan     1
Wichita State        1
Wisconsin            5
Wyoming              1
Xavier               1
Name: College, Length: 118, dtype: int64

In [253]:
total_number_of_nan_values = len(college)-college.value_counts(ascending=True).sum()

In [255]:
total_number_of_nan_values #highly unclean data

85

In [257]:
college.value_counts(dropna = False)

NaN                85
Kentucky           22
Duke               20
Kansas             18
North Carolina     16
                   ..
Utah Valley         1
Cleveland State     1
Iowa State          1
Florida State       1
Baylor              1
Name: College, Length: 119, dtype: int64

In [258]:
# fill() kisi value se
# dropna() remove krdo
# EDA - Exploratory data analysis, Pre processing, data cleaning, exploring the data

In [259]:
college

0                  Texas
1              Marquette
2      Boston University
3          Georgia State
4                    NaN
             ...
453               Butler
454                  NaN
455                  NaN
456               Kansas
457                  NaN
Name: College, Length: 458, dtype: object

In [261]:
clean_college = college.dropna()

In [263]:
clean_college
len(clean_college)

373

In [265]:
clean_college_two = college.fillna('Unknown')

In [266]:
len(clean_college_two)

458

# Basic Practice

In [267]:
employees = pd.read_csv('data/employees.csv')

In [268]:
employees

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [269]:
salary = employees['Salary'].copy()

In [270]:
bonus = employees['Bonus %'].copy()

In [271]:
salary

0       97308
1       61933
2      130590
3      138705
4      101004
        ...
995    132483
996     42392
997     96914
998     60500
999    129949
Name: Salary, Length: 1000, dtype: int64

In [272]:
bonus

0       6.945
1       4.170
2      11.858
3       9.340
4       1.389
        ...
995    16.655
996    19.675
997     1.421
998    11.985
999    10.169
Name: Bonus %, Length: 1000, dtype: float64

In [274]:
# salary 50000 se kam he unka average bonus kitna he

In [275]:
# series
salary_less_than_50000 = [i for i in salary.values if i < 50000] # ghatiya tareka revision 0

In [277]:
mask = salary < 50000

In [278]:
mask

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996     True
997    False
998    False
999    False
Name: Salary, Length: 1000, dtype: bool

In [280]:
salary_less_than_50000 = salary[mask]

In [281]:
salary_less_than_50000

7      45906
14     41426
25     37076
26     37598
38     36844
       ...
980    46233
984    43455
988    47638
989    38344
996    42392
Name: Salary, Length: 146, dtype: int64

In [286]:
bonus[mask].mean()

10.341438356164383

In [287]:
ans = 10.341438356164383

In [288]:
# how many people in senior management

In [296]:
senior_management = employees['Senior Management'].copy()

In [297]:
senior_management

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996    False
997    False
998    False
999     True
Name: Senior Management, Length: 1000, dtype: object

In [291]:
# Way 1

In [299]:
senior_management.value_counts(dropna = False)

True     468
False    465
NaN       67
Name: Senior Management, dtype: int64

In [294]:
senior_management.astype(bool)

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996    False
997    False
998    False
999     True
Name: Senior Management, Length: 1000, dtype: bool

In [302]:
senior_management.value_counts(dropna = False, normalize = True) * 100

True     46.8
False    46.5
NaN       6.7
Name: Senior Management, dtype: float64

# Interesting concept

In [316]:
gender = employees['Gender'].copy()

In [317]:
gender

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: object

In [318]:
gender.info()

<class 'pandas.core.series.Series'>
RangeIndex: 1000 entries, 0 to 999
Series name: Gender
Non-Null Count  Dtype
--------------  -----
855 non-null    object
dtypes: object(1)
memory usage: 7.9+ KB

In [319]:
gender1 = gender.dropna()

In [330]:
gender

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: object

In [321]:
gender.info()

<class 'pandas.core.series.Series'>
RangeIndex: 1000 entries, 0 to 999
Series name: Gender
Non-Null Count  Dtype
--------------  -----
855 non-null    object
dtypes: object(1)
memory usage: 7.9+ KB

In [322]:
gender1.info()

<class 'pandas.core.series.Series'>
Int64Index: 855 entries, 0 to 999
Series name: Gender
Non-Null Count  Dtype
--------------  -----
855 non-null    object
dtypes: object(1)
memory usage: 13.4+ KB

In [323]:
gender1.hasnans

False

In [324]:
gender1

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
994      Male
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 855, dtype: object

In [325]:
# In pandas object means String

In [326]:
gender1.nunique()

2

In [327]:
len(gender1)

855

In [331]:
# categorize kr skte hain
gender1 = gender1.astype('category')

In [332]:
gender1

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
994      Male
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 855, dtype: category
Categories (2, object): ['Female', 'Male']

In [333]:
gender1.info()

<class 'pandas.core.series.Series'>
Int64Index: 855 entries, 0 to 999
Series name: Gender
Non-Null Count  Dtype
--------------  -----
855 non-null    category
dtypes: category(1)
memory usage: 7.6 KB

In [334]:
chicago = pd.read_csv('data/chicago.csv')

In [335]:
chicago

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00
...,...,...,...,...
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00
32062,NaN,NaN,NaN,NaN

In [336]:
chicago_names = chicago['Name'].copy()

In [337]:
chicago_names

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [339]:
chicago_names = chicago_names.str.strip()

In [340]:
chicago_names

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32058     ZYGOWICZ,  PETER J
32059      ZYMANTAS,  MARK E
32060    ZYRKOWSKI,  CARLO E
32061    ZYSKOWSKI,  DARIUSZ
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [347]:
chicago_names.str.split(' ', expand=True)

                0    1          2        3     4     5     6
0          AARON,           ELVIA        J  None  None  None
1          AARON,         JEFFERY        M  None  None  None
2          AARON,          KARINA     None  None  None  None
3          AARON,       KIMBERLEI        R  None  None  None
4            ABAD  JR,             VICENTE     M  None  None
...           ...  ...        ...      ...   ...   ...   ...
32058   ZYGOWICZ,           PETER        J  None  None  None
32059   ZYMANTAS,            MARK        E  None  None  None
32060  ZYRKOWSKI,           CARLO        E  None  None  None
32061  ZYSKOWSKI,         DARIUSZ     None  None  None  None
32062         NaN  NaN        NaN      NaN   NaN   NaN   NaN

[32063 rows x 7 columns]

In [349]:
chicago[['x','y','z','d','e','f', 'j']] = chicago_names.str.split(' ', expand=True)

In [350]:
chicago

,Name,Position Title,Department,Employee Annual Salary,x,y,z,d,e,f,j
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00,"AARON,",,ELVIA,J,None,None,None
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00,"AARON,",,JEFFERY,M,None,None,None
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00,"AARON,",,KARINA,None,None,None,None
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00,"AARON,",,KIMBERLEI,R,None,None,None
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00,ABAD,"JR,",,VICENTE,M,None,None
...,...,...,...,...,...,...,...,...,...,...,...
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00,"ZYGOWICZ,",,PETER,J,None,None,None
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00,"ZYMANTAS,",,MARK,E,None,None,None
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00,"ZYRKOWSKI,",,CARLO,E,None,None,None
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00,"ZYSKOWSKI,",,DARIUSZ,None,None,None,None
32062,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,None,None,None

In [354]:
chicago_names.str.split(' ').str.get(0)

0            AARON,
1            AARON,
2            AARON,
3            AARON,
4              ABAD
            ...
32058     ZYGOWICZ,
32059     ZYMANTAS,
32060    ZYRKOWSKI,
32061    ZYSKOWSKI,
32062           NaN
Name: Name, Length: 32063, dtype: object